<div class = 'alert alert-info'>
    
**Import the data**

In [2]:
import pandas as pd

# Section 1
MTeams_Stage1 = pd.read_csv('../data/MDataFiles_Stage1/MTeams.csv')
# MTeams_Stage2 = pd.read_csv('../data/MDataFiles_Stage2/MTeams.csv')

MTSeasons_Stage1 = pd.read_csv('../data/MDataFiles_Stage1/MSeasons.csv')
# MTSeasons_Stage2 = pd.read_csv('../data/MDataFiles_Stage2/MSeasons.csv')

MNCAATourneySeeds_Stage1 = pd.read_csv('../data/MDataFiles_Stage1/MNCAATourneySeeds.csv')
# MNCAATourneySeeds_Stage2 = pd.read_csv('../data/MDataFiles_Stage2/MNCAATourneySeeds.csv')

MRegularSeasonCompactResults_Stage1 = pd.read_csv('../data/MDataFiles_Stage1/MRegularSeasonCompactResults.csv')
# MRegularSeasonCompactResults_Stage2 = pd.read_csv('../data/MDataFiles_Stage2/MRegularSeasonCompactResults.csv')

MNCAATourneyCompactResults_Stage1 = pd.read_csv('../data/MDataFiles_Stage1/MNCAATourneyCompactResults.csv')
# MNCAATourneyCompactResults_Stage2 = pd.read_csv('../data/MDataFiles_Stage2/MNCAATourneyCompactResults.csv')

In [3]:
# Section 2

MRegularSeasonDetailedResults_Stage1 = pd.read_csv('../data/MDataFiles_Stage1/MRegularSeasonDetailedResults.csv')
# MRegularSeasonDetailedResults_Stage2 = pd.read_csv('../data/MDataFiles_Stage2/MRegularSeasonDetailedResults.csv')

MNCAATourneyDetailedResults_Stage1 = pd.read_csv('../data/MDataFiles_Stage1/MNCAATourneyDetailedResults.csv')
# MNCAATourneyDetailedResults_Stage2 = pd.read_csv('../data/MDataFiles_Stage2/MNCAATourneyDetailedResults.csv')

In [4]:
# Section 3

Cities_Stage1 = pd.read_csv('../data/MDataFiles_Stage1/Cities.csv')
# Cities_Stage2 = pd.read_csv('../data/MDataFiles_Stage2/Cities.csv')

MGameCities_Stage1 = pd.read_csv('../data/MDataFiles_Stage1/MGameCities.csv')
# MGameCities_Stage2 = pd.read_csv('../data/MDataFiles_Stage2/MGameCities.csv')

In [5]:
# Section 4

MMasseyOrdinals_Stage1 = pd.read_csv('../data/MDataFiles_Stage1/MMasseyOrdinals.csv')
# MMasseyOrdinals_Stage2 = pd.read_csv('../data/MDataFiles_Stage2/MMasseyOrdinals.csv')

In [6]:
# Section 5

MEvents2015 = pd.read_csv('../data/MEvents2015.csv')
MEvents2016 = pd.read_csv('../data/MEvents2016.csv')
MEvents2017 = pd.read_csv('../data/MEvents2017.csv')
MEvents2018 = pd.read_csv('../data/MEvents2018.csv')
MEvents2019 = pd.read_csv('../data/MEvents2019.csv')
MPlayers    = pd.read_csv('../data/MPlayers.csv')

In [7]:
# Section 6

MTeamCoaches_Stage1 = pd.read_csv('../data/MDataFiles_Stage1/MTeamCoaches.csv')
# MTeamCoaches_Stage2 = pd.read_csv('../data/MDataFiles_Stage2/MTeamCoaches.csv')

Conferences_Stage1  = pd.read_csv('../data/MDataFiles_Stage1/Conferences.csv')
# Conferences_Stage2  = pd.read_csv('../data/MDataFiles_Stage2/Conferences.csv')

MTeamConferences_Stage1 = pd.read_csv('../data/MDataFiles_Stage1/MTeamConferences.csv')
# MTeamConferences_Stage2 = pd.read_csv('../data/MDataFiles_Stage2/MTeamConferences.csv')

MConferenceTourneyGames_Stage1 = pd.read_csv('../data/MDataFiles_Stage1/MConferenceTourneyGames.csv')
# MConferenceTourneyGames_Stage2 = pd.read_csv('../data/MDataFiles_Stage2/MConferenceTourneyGames.csv')

MSecondaryTourneyTeams_Stage1 = pd.read_csv('../data/MDataFiles_Stage1/MSecondaryTourneyTeams.csv')
# MSecondaryTourneyTeams_Stage2 = pd.read_csv('../data/MDataFiles_Stage2/MSecondaryTourneyTeams.csv')

MSecondaryTourneyCompactResults_Stage1 = pd.read_csv('../data/MDataFiles_Stage1/MSecondaryTourneyCompactResults.csv')
# MSecondaryTourneyCompactResults_Stage2 = pd.read_csv('../data/MDataFiles_Stage2/MSecondaryTourneyCompactResults.csv')

MTeamSpellings_Stage1 = pd.read_csv('../data/MDataFiles_Stage1/MTeamSpellings.csv', encoding = "ISO-8859-1", low_memory=False)
# MTeamSpellings_Stage2 = pd.read_csv('../data/MDataFiles_Stage2/MTeamSpellings.csv', encoding = "ISO-8859-1", low_memory=False)

MNCAATourneySlots_Stage1 = pd.read_csv('../data/MDataFiles_Stage1/MNCAATourneySlots.csv')
# MNCAATourneySlots_Stage2 = pd.read_csv('../data/MDataFiles_Stage2/MNCAATourneySlots.csv')

MNCAATourneySeedRoundSlots_Stage1 = pd.read_csv('../data/MDataFiles_Stage1/MNCAATourneySeedRoundSlots.csv')
# MNCAATourneySeedRoundSlots_Stage2 = pd.read_csv('../data/MDataFiles_Stage2/MNCAATourneySeedRoundSlots.csv')

In [32]:
tourney_result = MNCAATourneyCompactResults_Stage1.drop(['DayNum', 'WScore', 'LScore', 'WLoc', 'NumOT'], axis=1)
tourney_result

      Season  WTeamID  LTeamID
0       1985     1116     1234
1       1985     1120     1345
2       1985     1207     1250
3       1985     1229     1425
4       1985     1242     1325
...      ...      ...      ...
2246    2019     1120     1246
2247    2019     1277     1181
2248    2019     1403     1277
2249    2019     1438     1120
2250    2019     1438     1403

[2251 rows x 3 columns]

In [33]:
tourney_result = pd.merge(tourney_result, MNCAATourneySeeds_Stage1, left_on=['Season', 'WTeamID'], right_on=['Season', 'TeamID'], how='left')
tourney_result.rename(columns={'Seed':'WSeed'}, inplace=True)
tourney_result = tourney_result.drop('TeamID', axis=1)
tourney_result = pd.merge(tourney_result, MNCAATourneySeeds_Stage1, left_on=['Season', 'LTeamID'], right_on=['Season', 'TeamID'], how='left')
tourney_result.rename(columns={'Seed':'LSeed'}, inplace=True)
tourney_result = tourney_result.drop('TeamID', axis=1)
tourney_result

      Season  WTeamID  LTeamID WSeed LSeed
0       1985     1116     1234   X09   X08
1       1985     1120     1345   Z11   Z06
2       1985     1207     1250   W01   W16
3       1985     1229     1425   Y09   Y08
4       1985     1242     1325   Z03   Z14
...      ...      ...      ...   ...   ...
2246    2019     1120     1246   Y05   Y02
2247    2019     1277     1181   W02   W01
2248    2019     1403     1277   X03   W02
2249    2019     1438     1120   Z01   Y05
2250    2019     1438     1403   Z01   X03

[2251 rows x 5 columns]

In [34]:
def get_seed(x):
    return int(x[1:3])

tourney_result['WSeed'] = tourney_result['WSeed'].map(lambda x: get_seed(x))
tourney_result['LSeed'] = tourney_result['LSeed'].map(lambda x: get_seed(x))
tourney_result.rename(columns={'WSeed':'Seed1', 'LSeed':'Seed2', 'WTeamID': 'ID_Team1', 'LTeamID': 'ID_Team2'}, inplace=True)
tourney_result

      Season  ID_Team1  ID_Team2  Seed1  Seed2
0       1985      1116      1234      9      8
1       1985      1120      1345     11      6
2       1985      1207      1250      1     16
3       1985      1229      1425      9      8
4       1985      1242      1325      3     14
...      ...       ...       ...    ...    ...
2246    2019      1120      1246      5      2
2247    2019      1277      1181      2      1
2248    2019      1403      1277      3      2
2249    2019      1438      1120      1      5
2250    2019      1438      1403      1      3

[2251 rows x 5 columns]

In [161]:
import numpy as np

win_rate = {}
for season in range(1985,2020):
    regular_season = MRegularSeasonCompactResults_Stage1.iloc[np.where(MRegularSeasonCompactResults_Stage1['Season']==season)]
    
    lost_regular = pd.DataFrame(regular_season['LTeamID'].value_counts())
    lost_regular.columns = ['Nb_defeats']

    win_regular = pd.DataFrame(regular_season['WTeamID'].value_counts())
    win_regular.columns = ['Nb_victories']
    
    win_rate_season = {}
    for i in lost_regular.index:
        if i in win_regular.index:
            win_rate_season[i] = win_regular.loc[i].values[0]/(win_regular.loc[i].values[0] + lost_regular.loc[i].values[0])
        else:
            win_rate_season[i] = 0
    win_rate[season] = win_rate_season

In [176]:
tourney_result['Team1_win_rate'] = 0
tourney_result['Team2_win_rate'] = 0

for i in tourney_result.index:
    season = tourney_result.loc[i, 'Season']
    ID_Team1 = tourney_result.loc[i, 'ID_Team1']
    ID_Team2 = tourney_result.loc[i, 'ID_Team2']
    
    if ID_Team1 in win_rate[season].keys():
        tourney_result.loc[i, 'Team1_win_rate_for_the_season'] = win_rate[season][ID_Team1]
    else:
        tourney_result.loc[i, 'Team1_win_rate_for_the_season'] = 0
    if ID_Team2 in win_rate[season].keys():
        tourney_result.loc[i, 'Team2_win_rate_for_the_season'] = win_rate[season][ID_Team2]
    else:
        tourney_result.loc[i, 'Team2_win_rate_for_the_season'] = 0

In [177]:
tourney_result

,Season,ID_Team1,ID_Team2,Seed1,Seed2,Team1_win_rate,Team2_win_rate,Team1_win_rate_for_the_season,Team2_win_rate_for_the_season
0,1985,1116,1234,9,8,0.636364,0.666667,0.636364,0.666667
1,1985,1120,1345,11,6,0.620690,0.680000,0.620690,0.680000
2,1985,1207,1250,1,16,0.925926,0.379310,0.925926,0.379310
3,1985,1229,1425,9,8,0.740741,0.678571,0.740741,0.678571
4,1985,1242,1325,3,14,0.766667,0.740741,0.766667,0.740741
...,...,...,...,...,...,...,...,...,...
2246,2019,1120,1246,5,2,0.735294,0.818182,0.735294,0.818182
2247,2019,1277,1181,2,1,0.823529,0.852941,0.823529,0.852941
2248,2019,1403,1277,3,2,0.812500,0.823529,0.812500,0.823529
2249,2019,1438,1120,1,5,0.906250,0.735294,0.906250,0.735294
2250,2019,1438,1403,1,3,0.906250,0.812500,0.906250,0.812500

In [35]:
MTeams_Stage1.head()

   TeamID     TeamName  FirstD1Season  LastD1Season
0    1101  Abilene Chr           2014          2020
1    1102    Air Force           1985          2020
2    1103        Akron           1985          2020
3    1104      Alabama           1985          2020
4    1105  Alabama A&M           2000          2020

In [36]:
MTSeasons_Stage1.head()

   Season     DayZero RegionW    RegionX    RegionY    RegionZ
0    1985  10/29/1984    East       West    Midwest  Southeast
1    1986  10/28/1985    East    Midwest  Southeast       West
2    1987  10/27/1986    East  Southeast    Midwest       West
3    1988   11/2/1987    East    Midwest  Southeast       West
4    1989  10/31/1988    East       West    Midwest  Southeast

In [37]:
MNCAATourneySeeds_Stage1.head()

   Season Seed  TeamID
0    1985  W01    1207
1    1985  W02    1210
2    1985  W03    1228
3    1985  W04    1260
4    1985  W05    1374

In [38]:
MRegularSeasonCompactResults_Stage1.head()

   Season  DayNum  WTeamID  WScore  LTeamID  LScore WLoc  NumOT
0    1985      20     1228      81     1328      64    N      0
1    1985      25     1106      77     1354      70    H      0
2    1985      25     1112      63     1223      56    H      0
3    1985      25     1165      70     1432      54    H      0
4    1985      25     1192      86     1447      74    H      0

In [118]:
MNCAATourneyCompactResults_Stage1['LTeamID'].value_counts()

1242    32
1112    31
1181    29
1314    28
1277    28
        ..
1175     1
1179     1
1198     1
1194     1
1200     1
Name: LTeamID, Length: 300, dtype: int64

In [40]:
MRegularSeasonDetailedResults_Stage1.head()

,Season,DayNum,WTeamID,WScore,LTeamID,LScore,WLoc,NumOT,WFGM,WFGA,...,LFGA3,LFTM,LFTA,LOR,LDR,LAst,LTO,LStl,LBlk,LPF
0,2003,10,1104,68,1328,62,N,0,27,58,...,10,16,22,10,22,8,18,9,2,20
1,2003,10,1272,70,1393,63,N,0,26,62,...,24,9,20,20,25,7,12,8,6,16
2,2003,11,1266,73,1437,61,N,0,24,58,...,26,14,23,31,22,9,12,2,5,23
3,2003,11,1296,56,1457,50,N,0,18,38,...,22,8,15,17,20,9,19,4,3,23
4,2003,11,1400,77,1208,71,N,0,30,61,...,16,17,27,21,15,12,10,7,1,14

In [41]:
MNCAATourneyDetailedResults_Stage1.head()

,Season,DayNum,WTeamID,WScore,LTeamID,LScore,WLoc,NumOT,WFGM,WFGA,...,LFGA3,LFTM,LFTA,LOR,LDR,LAst,LTO,LStl,LBlk,LPF
0,2003,134,1421,92,1411,84,N,1,32,69,...,31,14,31,17,28,16,15,5,0,22
1,2003,136,1112,80,1436,51,N,0,31,66,...,16,7,7,8,26,12,17,10,3,15
2,2003,136,1113,84,1272,71,N,0,31,59,...,28,14,21,20,22,11,12,2,5,18
3,2003,136,1141,79,1166,73,N,0,29,53,...,17,12,17,14,17,20,21,6,6,21
4,2003,136,1143,76,1301,74,N,1,27,64,...,21,15,20,10,26,16,14,5,8,19

In [42]:
Cities_Stage1.head()

   CityID         City State
0    4001      Abilene    TX
1    4002        Akron    OH
2    4003       Albany    NY
3    4004  Albuquerque    NM
4    4005    Allentown    PA

In [43]:
MGameCities_Stage1.head()

   Season  DayNum  WTeamID  LTeamID   CRType  CityID
0    2010       7     1143     1293  Regular    4027
1    2010       7     1314     1198  Regular    4061
2    2010       7     1326     1108  Regular    4080
3    2010       7     1393     1107  Regular    4340
4    2010       9     1143     1178  Regular    4027

In [44]:
MMasseyOrdinals_Stage1.head()

   Season  RankingDayNum SystemName  TeamID  OrdinalRank
0    2003             35        SEL    1102          159
1    2003             35        SEL    1103          229
2    2003             35        SEL    1104           12
3    2003             35        SEL    1105          314
4    2003             35        SEL    1106          260

In [45]:
MEvents2015.head()

,EventID,Season,DayNum,WTeamID,LTeamID,WFinalScore,LFinalScore,WCurrentScore,LCurrentScore,ElapsedSeconds,EventTeamID,EventPlayerID,EventType,EventSubType,X,Y,Area
0,1,2015,11,1103,1420,74,57,0,0,19,1103,100,miss3,unk,0,0,0
1,2,2015,11,1103,1420,74,57,0,0,19,1420,11784,reb,def,0,0,0
2,3,2015,11,1103,1420,74,57,0,0,27,1420,11789,made2,dunk,0,0,0
3,4,2015,11,1103,1420,74,57,0,0,27,1420,11803,assist,NaN,0,0,0
4,5,2015,11,1103,1420,74,57,0,0,59,1103,87,made2,jump,0,0,0

In [46]:
MPlayers.head()

   PlayerID  LastName  FirstName  TeamID
0         1  Albright  Christian    1101
1         2   Cameron     Tobias    1101
2         3      Cobb      Chase    1101
3         4     Cooke     Austin    1101
4         5     Crnic      Jovan    1101

In [47]:
MTeamCoaches_Stage1.head()

   Season  TeamID  FirstDayNum  LastDayNum       CoachName
0    1985    1102            0         154   reggie_minton
1    1985    1103            0         154     bob_huggins
2    1985    1104            0         154  wimp_sanderson
3    1985    1106            0         154    james_oliver
4    1985    1108            0         154   davey_whitney

In [48]:
Conferences_Stage1.head()

  ConfAbbrev                   Description
0      a_sun       Atlantic Sun Conference
1      a_ten        Atlantic 10 Conference
2        aac  American Athletic Conference
3        acc     Atlantic Coast Conference
4        aec       America East Conference

In [49]:
MTeamConferences_Stage1.head()

   Season  TeamID ConfAbbrev
0    1985    1102        wac
1    1985    1103        ovc
2    1985    1104        sec
3    1985    1106       swac
4    1985    1108       swac

In [50]:
MConferenceTourneyGames_Stage1.head()

   Season ConfAbbrev  DayNum  WTeamID  LTeamID
0    2001      a_sun     121     1194     1144
1    2001      a_sun     121     1416     1240
2    2001      a_sun     122     1209     1194
3    2001      a_sun     122     1359     1239
4    2001      a_sun     122     1391     1273

In [51]:
MSecondaryTourneyTeams_Stage1.head()

   Season SecondaryTourney  TeamID
0    1985              NIT    1108
1    1985              NIT    1133
2    1985              NIT    1139
3    1985              NIT    1145
4    1985              NIT    1151

In [52]:
MSecondaryTourneyCompactResults_Stage1.head()

,Season,DayNum,WTeamID,WScore,LTeamID,LScore,WLoc,NumOT,SecondaryTourney
0,1985,136,1151,67,1155,65,H,0,NIT
1,1985,136,1153,77,1245,61,H,0,NIT
2,1985,136,1201,79,1365,76,H,0,NIT
3,1985,136,1231,79,1139,57,H,0,NIT
4,1985,136,1249,78,1222,71,H,0,NIT

In [53]:
MTeamSpellings_Stage1.head()

     TeamNameSpelling  TeamID
0    a&m-corpus chris    1394
1  a&m-corpus christi    1394
2         abilene chr    1101
3   abilene christian    1101
4   abilene-christian    1101

In [54]:
MNCAATourneySlots_Stage1.head()

   Season  Slot StrongSeed WeakSeed
0    1985  R1W1        W01      W16
1    1985  R1W2        W02      W15
2    1985  R1W3        W03      W14
3    1985  R1W4        W04      W13
4    1985  R1W5        W05      W12

In [55]:
MNCAATourneySeedRoundSlots_Stage1.head()

  Seed  GameRound GameSlot  EarlyDayNum  LateDayNum
0  W01          1     R1W1          136         137
1  W01          2     R2W1          138         139
2  W01          3     R3W1          143         144
3  W01          4     R4W1          145         146
4  W01          5     R5WX          152         152